{
    "data": [
        {
            "id": 1,
            "title": "Pokemon Research",
            "desktopImage": "/portifolio/assets/desktop-pokemon-project-fC5oxj_P.png",
            "mobileImage": "/portifolio/assets/mobile-pokemon-project-6US9NryX.png",
            "site": "https://jose08victor.github.io/pokemon-research/",
            "github": "https://github.com/Jose08Victor/pokemon-research.git",
            "description": "Este projeto apresenta uma lista de Pokémons da 1ª Geração, desenvolvido utilizando React para aproveitar o conceito de Single Page Applications (SPA). As informações dos Pokémons foram obtidas através da API pokeapi.co. O react-router-dom foi utilizado para facilitar a navegação entre as páginas. Além disso, a Context API foi utilizada para criar um Theme Toggler, permitindo a alternância entre os temas claro e escuro. A estilização completa do projeto foi realizada com o uso do styled-components."
        },
        {
            "id": 2,
            "title": "Section With Dropdown Navigation",
            "desktopImage": "/portifolio/assets/desktop-section-project-z_wRpITF.png",
            "mobileImage": "/portifolio/assets/mobile-section-project-0op0Iuul.png",
            "site": "https://jose08victor.github.io/intro-section-with-dropdown-navigation/",
            "github": "https://github.com/Jose08Victor/intro-section-with-dropdown-navigation.git",
            "description": "O projeto visa simular um website representativo de uma empresa especializada em desenvolver soluções para ambientes de trabalho remotos. Seu propósito central é facilitar e organizar empresas que já adotam essa modalidade de trabalho ou ajudar empresas que tenham interesse em incorporá-la em suas operações."
        },
        {
            "id": 3,
            "title": "Clipboard Landing Page",
            "desktopImage": "/portifolio/assets/desktop-landing-page-project-1bhydDru.gif",
            "mobileImage": "/portifolio/assets/mobile-landing-page-project-6xtMAifN.gif",
            "site": "https://jose08victor.github.io/clipboard-landing-page/",
            "github": "https://github.com/Jose08Victor/clipboard-landing-page.git",
            "description": "Esta landing page foi construída exclusivamente utilizando HTML e CSS, sendo resultado de um desafio proposto pela Front-end Mentor. A iniciativa representou uma valiosa oportunidade de aprimorar minhas habilidades, especialmente no domínio de técnicas como flexibilidade, responsividade e organização de múltiplos arquivos CSS."
        },
        {
            "id": 4,
            "title": "Profile Search | GitHub Api",
            "desktopImage": "/portifolio/assets/desktop-git-hub-project-ioJ8JdkS.png",
            "mobileImage": "/portifolio/assets/mobile-git-hub-project-OnCAByM-.png",
            "site": "https://jose08victor.github.io/profile-search---giithub-api/",
            "github": "https://github.com/Jose08Victor/profile-search---giithub-api.git",
            "description": "Esse projeto apresenta um campo de pesquisa no qual é possível inserir o nome do usuário cujo perfil se deseja visualizar. Ao acionar o botão 'Buscar' ou pressionar a tecla Enter, o sistema realiza uma busca utilizando a API do GitHub.Resultante de um desafio no módulo avançado de JavaScript oferecido pela DevQuest no curso de desenvolvimento front-end, este projeto reflete a aplicação prática dos conceitos aprendidos."
        },
        {
            "id": 5,
            "title": "Portifólio",
            "desktopImage": "/portifolio/assets/desktop-portfolio-project-nIOQ4ck6.png",
            "mobileImage": "/portifolio/assets/mobile-portfolio-project-vXTv-pP2.png",
            "github": "https://github.com/Jose08Victor/portifolio.git",
            "description": "Com muito orgulho, apresento este projeto que desenvolvi com dedicação e atenção aos detalhes. A criação, realizada com o framework React.js, integrando-se junto às bibliotecas React-Router-Dom e Styled-Components. Ao utilizar essa combinação de tecnologias, busquei não apenas um resultado esteticamente agradável, mas também uma experiência fluida e eficiente para o usuário."
        }
    ]
}